{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "name": "conv2d_1", "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_2", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_3", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_4", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_5", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_6", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "filters": 3, "padding": "same", "trainable": true, "bias_constraint": null, "name": "conv2d_7", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}}]}, "keras_version": "2.2.4"}